kumpulan-latihan-laravel/laravel-wpu-8/routes/web.php

SELECT * FROM `categories`
---
Route::get('/categories', function () {
    $data = [
        'title'      => 'categories',
        'categories' => Category::all()