kumpulan-latihan-laravel/laravel-wpu-8/app/Http/Controllers/DashboardPostController.php

    public function index()
    {
        $data = [
            'title' => 'Dashboard Posts',
            'posts' => Post::where('user_id', auth()->user()->id)->get()
---
SELECT * FROM `posts` WHERE `user_id` = 10

    public function create()
    {
        return view('dashboard.posts.create', [
            'title'      => 'Create New Posts',
            'categories' => Category::all()
---
SELECT * FROM `categories`

    public function edit(Post $post)
    {
        return view('dashboard.posts.edit', [
            'title'      => 'Create New Posts',
            'post'       => $post,
            'categories' => Category::all()
---
SELECT * FROM `categories`

    public function update(Request $request, Post $post)
    {
        $rules = [
            'title'       => 'required|max:150',
            'category_id' => 'required',
            'image'       => 'image|file|max:1024',
            'body'        => 'required'
        ];

        if ($request->slug != $post->slug) {
            $rules['slug'] = 'required|unique:posts';
        }

        $validatedData = $request->validate($rules);

        if ($request->file('image')) {
            if ($request->oldImage) {
                Storage::delete($request->oldImage);
            }
            $validatedData['image'] = $request->file('image')->store('post-images');
        }

        $validatedData['user_id'] = auth()->user()->id;
        $validatedData['excerpt'] = Str::limit(strip_tags($request->body), 200);

        Post::where('id', $post->id)
            ->update($validatedData);
---
UPDATE `posts` SET `title` = 'Deserunt voluptatibus.', `category_id` = '5', `image` = 'post-images/NjSF528zbk9yr8mxixRswPGD1uY6qHJACA3W0uN5.jpg', `body` = '<div>Aliquid sed vitae incidunt dolor aspernatur. Nihil sit earum vero placeat et in iste. Et ipsa cumque qui dolorum consequuntur. Eius id pariatur voluptatem placeat nulla sit odit reprehenderit. Reprehenderit velit eos autem.<br><br></div><div>Consequatur qui esse tempora soluta exercitationem. Dolorum aspernatur culpa nulla quae nam quia. Laborum nam velit est fugiat et. Molestias a officia iste et magnam molestiae.<br><br></div><div>Dicta culpa cum vel dolorem. At accusamus aut beatae dolores alias vel quod. Repudiandae omnis nobis eum cum.<br><br></div><div>Laborum dolores magnam nisi cum ipsam quis. Eveniet dolores libero eligendi provident eaque quia id. Mollitia et cum ex expedita neque facere quam.<br><br></div><div>Quasi voluptas et in suscipit itaque magnam. Veritatis odit atque incidunt veritatis.<br><br></div>', `user_id` = 10, `excerpt` = 'Aliquid sed vitae incidunt dolor aspernatur. Nihil sit earum vero placeat et in iste. Et ipsa cumque qui dolorum consequuntur. Eius id pariatur voluptatem placeat nulla sit odit reprehenderit. Reprehe...', `posts`.`updated_at` = '2022-05-30 12:25:29' WHERE `id` = 26

    public function destroy(Post $post)
    {
        if ($post->image) {
            Storage::delete($post->image);
        }
        Post::destroy($post->id);

        return redirect('/dashboard/posts')->with('success', 'Post has been deleted');
---
DELETE FROM `posts` WHERE `id` = 23
SELECT * FROM `posts` WHERE `id` in (23)